<template>
  <el-row :gutter="100" class="panel-group">
    <el-col :xs="24" :sm="8" :lg="8" class="card-panel-col">
      <div class="card-panel">
        <div class="card-panel-icon-wrapper icon-init" @click="showComponent('transactionTable')">
          <svg t="1692103562437" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4090" width="64" height="64"><path d="M96 576.512C96 646.72 253.568 704 448 704c45.184 0 88.384-3.072 128.064-8.768v224c-39.68 5.696-82.88 8.768-128.064 8.768-194.432 0-352-57.28-352-128V576.512zM755.2 800c7.04 0 12.8 5.76 12.8 12.8v102.4a12.8 12.8 0 0 1-12.8 12.8h-102.4a12.8 12.8 0 0 1-12.8-12.8v-102.4c0-7.04 5.76-12.8 12.8-12.8h102.4z m160 0c7.04 0 12.8 5.76 12.8 12.8v102.4a12.8 12.8 0 0 1-12.8 12.8h-102.4a12.8 12.8 0 0 1-12.8-12.8v-102.4c0-7.04 5.76-12.8 12.8-12.8h102.4z m-42.176-177.472l72.448 72.448a12.8 12.8 0 0 1 0 18.048l-72.448 72.448a12.8 12.8 0 0 1-18.048 0l-72.448-72.448a12.8 12.8 0 0 1 0-18.048l72.448-72.448a12.8 12.8 0 0 1 18.048 0zM755.2 640c7.04 0 12.8 5.76 12.8 12.8v102.4a12.8 12.8 0 0 1-12.8 12.8h-102.4a12.8 12.8 0 0 1-12.8-12.8v-102.4c0-7.04 5.76-12.8 12.8-12.8h102.4z m44.8-352V512l-0.448 6.4c-2.816 20.928-19.456 40.512-46.72 57.6H601.6a25.6 25.6 0 0 0-25.6 25.6l0.064 29.632C536.384 636.928 493.184 640 448 640c-194.432 0-352-57.28-352-128V288c0 70.72 157.568 128 352 128s352-57.28 352-128zM448 96c194.432 0 352 57.28 352 128s-157.568 128-352 128-352-57.28-352-128 157.568-128 352-128z" p-id="4091" fill="#515151"></path></svg>
        </div>
        <div class="card-panel-description">
          <div class="card-panel-text">
            上传原始数据
          </div>
          <count-to :start-val="0" :end-val="20" :duration="2800" class="card-panel-num" />
        </div>
      </div>
    </el-col>
    <el-col :xs="24" :sm="8" :lg="8" class="card-panel-col">
      <div class="card-panel">
        <div class="card-panel-icon-wrapper icon-prep" @click="showComponent('preTransactionTable')">
          <svg t="1692103897152" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5713" width="64" height="64"><path d="M452 642.268q4.179 0 8.336-0.032v-55.115a32 32 0 0 1 19.42-29.424L721.42 454.378a32 32 0 0 1 25.16 0l77.42 33.1V354.625c-79.924 55.277-226.2 81.008-372 81.008S159.922 409.9 80 354.625v165.656c0 67.189 166.625 121.987 372 121.987z" p-id="5714" fill="#65beed"></path><path d="M452 370.818c205.375 0 372-54.709 372-121.787v-63.245C824 118.708 657.375 64 452 64S80 118.708 80 185.786v63.245c0 67.078 166.625 121.787 372 121.787zM460.336 915.456v-205.7q-4.167 0.027-8.336 0.031c-145.8 0-292.078-25.732-372-81.008v164.765c0 67.189 166.625 121.987 372 121.987q4.18 0 8.338-0.032l-0.002-0.043zM954.6 704l-218.4 86.4H733L514.6 704c-1.6 0-1.6-1.6-2.4-2.4v64.8a2.554 2.554 0 0 0 2.4 2.4L733 855.2h3.2l218.4-86.4 2.4-2.4v-64a2.842 2.842 0 0 0-2.4 1.6zM512.8 871.2v-0.522c-0.251-0.243-0.324-0.126 0 0.522z" p-id="5715" fill="#65beed"></path><path d="M514.4 667.2l218.4 86.4h3.2l218.4-86.4 2.4-2.4v-63.2a2.554 2.554 0 0 0-2.4-2.4L736 512.8h-3.2l-218.4 86.4a2.554 2.554 0 0 0-2.4 2.4v63.2a3.606 3.606 0 0 0 2.4 2.4zM771.2 632l-24.8 44.8-80-32s-1.6 0 0-1.6a1.567 1.567 0 0 1 1.6-1.6l101.6-11.2h1.6z m127.2-30.4v3.2L843.2 628l-62.4-24.8V600l55.2-23.2z m-236.8-38.4l41.6-7.2-9.6-17.6V536h1.6l36 13.6 41.6-7.2h1.6v1.6L756 560l34.4 13.6s1.6 1.6 0 1.6a1.567 1.567 0 0 1-1.6 1.6l-48-2.4L720 592h-1.6l-9.6-22.4-48-2.4c-0.8-2.4-0.8-2.4 0.8-4z m-74.4 27.2c9.6-4.8 20.8-6.4 34.4-6.4s27.2 2.4 36.8 6.4c11.2 2.4 16.8 11.2 16.8 16s-4.8 11.2-13.6 13.6a142.638 142.638 0 0 1-34.4 4.8c-13.6 0-28-2.4-36.8-6.4-11.2-2.4-16-11.2-16-16-1.6-4.8 2.4-9.6 12.8-12zM954.4 808.8l-217.6 86.4h-3.2l-218.4-86.4c-1.6 0-1.6-1.6-2.4-2.4v64.278a8.436 8.436 0 0 1 1.6 2.922L732.8 960h3.2l218.4-86.4 2.4-2.4v-64.8c0 1.6-1.6 1.6-2.4 2.4z" p-id="5716" fill="#65beed"></path></svg>
        </div>
        <div class="card-panel-description">
          <div class="card-panel-text">
            预处理后数据
          </div>
          <count-to :start-val="0" :end-val="18" :duration="3000" class="card-panel-num" />
        </div>
      </div>
    </el-col>
    <el-col :xs="24" :sm="8" :lg="8" class="card-panel-col">
      <div class="card-panel">
        <div class="card-panel-icon-wrapper icon-pred" @click="showComponent('lineCharts')">
          <svg t="1692104194688" class="icon" viewBox="0 0 1031 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="15833" width="64" height="64"><path d="M433.938773 377.514667c239.240533 0 426.666667-82.875733 426.666667-188.757334l-0.068267-0.512L860.60544 187.733333C860.60544 82.466133 673.21344 0 433.938773 0 194.732373 0 7.272107 82.466133 7.272107 187.733333l0.068266 0.512L7.272107 188.757333c0 105.8816 187.460267 188.757333 426.666666 188.757334z m0 202.786133c255.214933 0 426.666667-79.4624 426.666667-153.634133V316.689067a17.066667 17.066667 0 0 0-27.921067-13.2096C753.08544 368.981333 600.338773 409.6 433.938773 409.6 267.572907 409.6 114.792107 368.981333 35.15904 303.5136A17.134933 17.134933 0 0 0 7.272107 316.7232v109.9776c0 74.171733 171.451733 153.6 426.666666 153.6z m0 204.765867a1130.837333 1130.837333 0 0 0 107.144534-5.085867 17.066667 17.066667 0 0 0 15.2576-14.574933 254.395733 254.395733 0 0 1 64.785066-136.0896 17.066667 17.066667 0 0 0-15.223466-28.398934A1103.121067 1103.121067 0 0 1 433.938773 614.4C268.699307 614.4 115.474773 578.935467 34.13504 521.796267a17.066667 17.066667 0 1 0-26.862933 13.960533V631.466667C7.272107 705.6384 178.72384 785.066667 433.938773 785.066667z m120.968534 44.3392a17.032533 17.032533 0 0 0-18.5344-15.189334A1126.912 1126.912 0 0 1 433.938773 819.2C268.699307 819.2 115.474773 783.735467 34.13504 726.596267a17.066667 17.066667 0 1 0-26.862933 13.960533v60.5184c0 105.8816 187.426133 188.757333 426.666666 188.757333a941.397333 941.397333 0 0 0 156.091734-12.765866 17.066667 17.066667 0 0 0 11.025066-26.7264 255.761067 255.761067 0 0 1-46.148266-120.9344zM809.40544 580.266667c-122.333867 0-221.866667 99.5328-221.866667 221.866666s99.5328 221.866667 221.866667 221.866667 221.866667-99.5328 221.866667-221.866667-99.5328-221.866667-221.866667-221.866666z m102.4 238.933333H826.472107v85.333333a17.066667 17.066667 0 0 1-34.133334 0V819.2h-85.333333a17.066667 17.066667 0 0 1 0-34.133333H792.338773v-85.333334a17.066667 17.066667 0 0 1 34.133334 0V785.066667h85.333333a17.066667 17.066667 0 0 1 0 34.133333z" p-id="15834" fill="#4459d1"></path></svg>
        </div>
        <div class="card-panel-description">
          <div class="card-panel-text">
            预测数据
          </div>
          <count-to :start-val="0" :end-val="10" :duration="3200" class="card-panel-num" />
        </div>
      </div>
    </el-col>
  </el-row>
</template>

<script>
import CountTo from 'vue-count-to'

export default {
  components: {
    CountTo
  },
  methods: {
    showComponent(componentName) {
      this.$emit('changeComponent', componentName);
    }
  }
}
</script>

<style lang="scss" scoped>
.panel-group {
  margin-top: 30px;
  width: 80%;
  .card-panel-col {
    margin-bottom: 32px;
  }

  .card-panel {
    height: 108px;
    cursor: pointer;
    font-size: 12px;
    position: relative;
    overflow: hidden;
    color: #666;
    background: #fff;
    box-shadow: 4px 4px 40px rgba(0, 0, 0, .05);
    border-color: rgba(0, 0, 0, .05);

    &:hover {
      .card-panel-icon-wrapper {
        color: #fff;
      }

      .icon-init {
        background: #8cecea;
      }

      .icon-prep {
        background: #becfdb;
      }

      .icon-pred {
        background: #d5e58e;
      }
    }

    .card-panel-icon-wrapper {
      float: left;
      margin: 4px 0 0 4px;
      padding: 16px;
      transition: all 0.38s ease-out;
      border-radius: 6px;
    }

    .card-panel-icon {
      float: left;
      font-size: 48px;
    }

    .card-panel-description {
      float: right;
      font-weight: bold;
      margin: 26px;
      margin-left: 0px;

      .card-panel-text {
        line-height: 18px;
        color: rgba(0, 0, 0, 0.45);
        font-size: 16px;
        margin-bottom: 12px;
      }

      .card-panel-num {
        font-size: 20px;
      }
    }
  }
}

@media (max-width:550px) {
  .card-panel-description {
    display: none;
  }

  .card-panel-icon-wrapper {
    float: none !important;
    width: 100%;
    height: 100%;
    margin: 0 !important;

    .svg-icon {
      display: block;
      margin: 14px auto !important;
      float: none !important;
    }
  }
}
</style>
